   x1=2;x2=2.222222;
   PX1=0;PX2=0;PX3=0;PX4=0;
   tic
   for i=1:10^8
       PX1=1+2*x1^3+3*x1^7+4*x1^11+5*x1^15;%x=2时采用直接算法
   end
   toc
   fprintf('x=2直接算法结果：%.12f\n',PX1)
   tic
   for i=1:10^8
       PX3=1+x1^3*(2+x1^4*(3+x1^4*(4+5*x1^4)));%x=2时采用优化算法
   end
   toc
   fprintf('x=2优化算法结果：%.12f\n',PX3)
   tic
   for i=1:10^8
       PX2=1+2*x2^3+3*x2^7+4*x2^11+5*x2^15;%x=2.222222时采用直接算法
   end
   toc
   fprintf('x=2.222222直接算法结果：%.12f\n',PX2)
   tic
   for i=1:10^8
       PX4=1+x2^3*(2+x2^4*(3+x2^4*(4+5*x2^4)));%x=2.222222时采用优化算法
   end
   toc
   fprintf('x=2.222222优化算法结果：%.12f\n',PX4)
   